In [37]:
import pandas as pd

df = pd.read_csv("./emp.csv")
df

   ID           Name Department   Age   Salary Joining_Date
0   1       John Doe         HR  28.0  50000.0   2020-05-21
1   2     Jane Smith         IT  34.0  75000.0   2019-06-12
2   3    Bob Johnson    Finance  45.0  85000.0   2018-07-15
3   4    Alice White         IT   NaN  72000.0   2021-01-04
4   5  Charlie Brown  Marketing  32.0  68000.0   2019-11-30
5   6      Eva Green        NaN  41.0  54000.0   2017-04-22
6   7     Mike Davis    Finance  50.0  90000.0   2016-08-19
7   8   Linda Taylor         IT  26.0  64000.0   2022-02-10
8   9   James Wilson  Marketing  38.0      NaN   2020-09-08
9  10    Sarah Adams         HR  30.0  55000.0   2021-03-18

In [38]:
"""
- Load the employees.csv file into a DataFrame.
- Display:
    The first 5 rows of the dataset
    Dataset information (info())
    Statistical summary of numerical columns (describe())
- Check if there are any missing values in the dataset
- Handle missing values using one of the following methods:
    Fill missing salaries with the average salary
    OR
    Drop rows that contain missing values
- Convert the Joining_Date column to a datetime format.
- Display only the Name, Department, and Salary columns.
- Filter and display employees who:
    Work in the IT department
    Are older than 30 years
-Add a new column called Salary_After_Raise that increases each employee’s salary by 5%.
- Sort employees by Age in descending order.
- Calculate The average salary per department
- Calculate The number of employees in each department
- Find all employees who joined after January 1, 2020.
- final save the new data into csv and excel file
 
* Advance
- Identify the top 3 highest-paid employees
- Create the following new columns:
    Experience_Years → number of years since joining (based on current year)
    Age_Group:
        Under 25
        25–35
        36–50
        Above 50
- Identify employees whose salary is:
    Above their department’s average
    Below their department’s average
 
- Create a column called High_Earner:
    Yes if salary > 75th percentile
    No otherwise
 
- Create a column called Senior_Employee:
    Yes if Experience_Years ≥ 5
    No otherwise
"""

'\n- Load the employees.csv file into a DataFrame.\n- Display:\n    The first 5 rows of the dataset\n    Dataset information (info())\n    Statistical summary of numerical columns (describe())\n- Check if there are any missing values in the dataset\n- Handle missing values using one of the following methods:\n    Fill missing salaries with the average salary\n    OR\n    Drop rows that contain missing values\n- Convert the Joining_Date column to a datetime format.\n- Display only the Name, Department, and Salary columns.\n- Filter and display employees who:\n    Work in the IT department\n    Are older than 30 years\n-Add a new column called Salary_After_Raise that increases each employee’s salary by 5%.\n- Sort employees by Age in descending order.\n- Calculate The average salary per department\n- Calculate The number of employees in each department\n- Find all employees who joined after January 1, 2020.\n- final save the new data into csv and excel file\n\n* Advance\n- Identify the top 3 highest-paid employees\n- Create the following new columns:\n    Experience_Years → number of years since joining (based on current year)\n    Age_Group:\n        Under 25\n        25–35\n        36–50\n        Above 50\n- Identify employees whose salary is:\n    Above their department’s average\n    Below their department’s average\n\n- Create a column called High_Earner:\n    Yes if salary > 75th percentile\n    No otherwise\n\n- Create a column called Senior_Employee:\n    Yes if Experience_Years ≥ 5\n    No otherwise\n'

In [39]:
# - Display:
#     The first 5 rows of the dataset
#     Dataset information (info())
#     Statistical summary of numerical columns (describe())
print(df.head(5))
print(df.info())
print(df.describe())

   ID           Name Department   Age   Salary Joining_Date
0   1       John Doe         HR  28.0  50000.0   2020-05-21
1   2     Jane Smith         IT  34.0  75000.0   2019-06-12
2   3    Bob Johnson    Finance  45.0  85000.0   2018-07-15
3   4    Alice White         IT   NaN  72000.0   2021-01-04
4   5  Charlie Brown  Marketing  32.0  68000.0   2019-11-30
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    9 non-null      object
 3   Age           9 non-null      float64
 4   Salary        9 non-null      float64
 5   Joining_Date  10 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 612.0+ bytes
None
             ID        Age        Salary
count  10.00000   9.000000      9.000000
mean    5.50000  36.000000  68111.111111
std     3.02765   8.108637  13887.444369
min     1.00000  26.000000  50000.000000
25%     3.25000  30.000000  55000.000000
50%     5.50000  34.000000  68000.000000
75%     7.75000  41.000000  75000.000000
max    10.00000  50.000000  90000.000000

In [40]:
# Check if there are any missing values in the dataset
df.isnull().sum()

ID              0
Name            0
Department      1
Age             1
Salary          1
Joining_Date    0
dtype: int64

In [41]:
# - Handle missing values using one of the following methods:
#     Fill missing salaries with the average salary
#     OR
#     Drop rows that contain missing values
df["Salary"] = df["Salary"].fillna(df["Salary"].mean())

In [42]:
# - Convert the Joining_Date column to a datetime format.
df["Joining_Date"] = pd.to_datetime(df["Joining_Date"])

In [43]:
df

   ID           Name Department   Age        Salary Joining_Date
0   1       John Doe         HR  28.0  50000.000000   2020-05-21
1   2     Jane Smith         IT  34.0  75000.000000   2019-06-12
2   3    Bob Johnson    Finance  45.0  85000.000000   2018-07-15
3   4    Alice White         IT   NaN  72000.000000   2021-01-04
4   5  Charlie Brown  Marketing  32.0  68000.000000   2019-11-30
5   6      Eva Green        NaN  41.0  54000.000000   2017-04-22
6   7     Mike Davis    Finance  50.0  90000.000000   2016-08-19
7   8   Linda Taylor         IT  26.0  64000.000000   2022-02-10
8   9   James Wilson  Marketing  38.0  68111.111111   2020-09-08
9  10    Sarah Adams         HR  30.0  55000.000000   2021-03-18

In [44]:
#  Display only the Name, Department, and Salary columns.
df.loc[:,["Name","Department","Salary"]]

            Name Department        Salary
0       John Doe         HR  50000.000000
1     Jane Smith         IT  75000.000000
2    Bob Johnson    Finance  85000.000000
3    Alice White         IT  72000.000000
4  Charlie Brown  Marketing  68000.000000
5      Eva Green        NaN  54000.000000
6     Mike Davis    Finance  90000.000000
7   Linda Taylor         IT  64000.000000
8   James Wilson  Marketing  68111.111111
9    Sarah Adams         HR  55000.000000

In [45]:
# - Filter and display employees who:
#     Work in the IT department
#     Are older than 30 years

df[(df["Department"] == "IT") & (df["Age"] > 30)]

   ID        Name Department   Age   Salary Joining_Date
1   2  Jane Smith         IT  34.0  75000.0   2019-06-12

In [46]:
# Add a new column called Salary_After_Raise that increases each employee’s salary by 5%.

df["Salary_After_Raise"] = (df["Salary"] * 0.05).astype(int)
df

,ID,Name,Department,Age,Salary,Joining_Date,Salary_After_Raise
0,1,John Doe,HR,28.0,50000.000000,2020-05-21,2500
1,2,Jane Smith,IT,34.0,75000.000000,2019-06-12,3750
2,3,Bob Johnson,Finance,45.0,85000.000000,2018-07-15,4250
3,4,Alice White,IT,NaN,72000.000000,2021-01-04,3600
4,5,Charlie Brown,Marketing,32.0,68000.000000,2019-11-30,3400
5,6,Eva Green,NaN,41.0,54000.000000,2017-04-22,2700
6,7,Mike Davis,Finance,50.0,90000.000000,2016-08-19,4500
7,8,Linda Taylor,IT,26.0,64000.000000,2022-02-10,3200
8,9,James Wilson,Marketing,38.0,68111.111111,2020-09-08,3405
9,10,Sarah Adams,HR,30.0,55000.000000,2021-03-18,2750

In [ ]:
# - Sort employees by Age in descending order.
df.sort_values(by="Age",ascending=False)
# - Calculate The average salary per department
df.groupby("Department")["Salary"].mean()
# - Calculate The number of employees in each department
df.groupby("Department")["ID"].count()
# - Find all employees who joined after January 1, 2020.
df[df["Joining_Date"] > "2020 , 1 , 1"]
# - final save the new data into csv and excel file

In [60]:
df.to_csv("./final.csv")

In [71]:
df["average_salary_per_department"] = df.groupby("Department")["Salary"].transform("mean")

In [72]:
df

,ID,Name,Department,Age,Salary,Joining_Date,Salary_After_Raise,average_salary_per_department
0,1,John Doe,HR,28.0,50000.000000,2020-05-21,2500,52500.000000
1,2,Jane Smith,IT,34.0,75000.000000,2019-06-12,3750,70333.333333
2,3,Bob Johnson,Finance,45.0,85000.000000,2018-07-15,4250,87500.000000
3,4,Alice White,IT,NaN,72000.000000,2021-01-04,3600,70333.333333
4,5,Charlie Brown,Marketing,32.0,68000.000000,2019-11-30,3400,68055.555556
5,6,Eva Green,NaN,41.0,54000.000000,2017-04-22,2700,NaN
6,7,Mike Davis,Finance,50.0,90000.000000,2016-08-19,4500,87500.000000
7,8,Linda Taylor,IT,26.0,64000.000000,2022-02-10,3200,70333.333333
8,9,James Wilson,Marketing,38.0,68111.111111,2020-09-08,3405,68055.555556
9,10,Sarah Adams,HR,30.0,55000.000000,2021-03-18,2750,52500.000000